app/services/create.rb

      def call
        validate_schema
        validate_ep_already_exist

        self.endpoint = ::Endpoint.create!(
          verb: verb,
          path: path,
          response_code: response[:code],
          response_headers: response[:headers],
          response_body: response[:body]
        )
---
INSERT INTO "endpoints" ("verb", "path", "response_code", "response_headers", "response_body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

      def validate_ep_already_exist
        return unless Endpoint.exists?(['UPPER(verb) = ? AND LOWER(path) = ?', verb.upcase,
                                        path.downcase])
---
SELECT 1 AS one FROM "endpoints" WHERE (UPPER(verb) = 'GET' AND LOWER(path) = '/test_create') LIMIT $1  [["LIMIT", 1]]