app/services/delete.rb

SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
---
      def call
        endpoint = Endpoint.find_by(id: id)