app/services/patch.rb

      def find_endpoint
        self.endpoint = ::Endpoint.find(id)
---
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]