app/api/endpoints/index.rb

SELECT "endpoints".* FROM "endpoints"
---
    class Index < Grape::API
      desc 'Get all mock endpoints'
      get do
        endpoints = Endpoint.all