app/api/endpoints/root.rb

SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."access_token" = $1 LIMIT $2  [["access_token", "7a58bed399beccc64e6c6b6798dc42445d211163"], ["LIMIT", 1]]
---
        def valid_api_key?
          token = headers['Authorization']&.split(' ')&.last
          @api_key = ApiKey.find_by(access_token: token)

SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."path" = $1 AND "endpoints"."verb" = $2 LIMIT $3  [["path", "/api/endpoints"], ["verb", "GET"], ["LIMIT", 1]]
---
        def current_api_key
          @api_key
        end
      end

      before do
        authenticate! unless request.path == '/status'
      end

      resource :endpoints do
        mount Create
        mount Index
        mount Delete
        mount Patch
      end

      # Test endpoint
      get :status do
        { status: 'OK' }
      end

      # TODO: need to add separate service and add rspecs
      # TODO: don't allow in create to create endpoints which already declared in routes
      route :any, '*path' do
        path = "/#{params[:path]}"
        verb = request.request_method.upcase
        endpoint = Endpoint.find_by(path: path, verb: verb)